---
kind: type
id: T:Autodesk.Revit.DB.BRepBuilder
source: html/94c1fef4-2933-ce67-9c2d-361cbf8a42b4.htm
---
# Autodesk.Revit.DB.BRepBuilder

A class that allows direct construction of geometry objects (solids, open shells, etc.).

## Syntax (C#)
```csharp
public class BRepBuilder : ShapeBuilder
```